{"@context":"https://schema.org","@type":"Recipe","aggregateRating":{"@type":"AggregateRating","bestRating":"5","ratingCount":14,"ratingValue":"4.0","worstRating":"0"},"author":"Simon Difford","datePublished":"2016-07-13 12:32:44","description":"A relation of the Aviation [see history], the Blue Moon features on the back label of Créme Yvette bottles dating from the 1940's. This cocktail became so synonymous with Créme Yvette that when production of the liqueur ceased in 1969 the cocktail was also forgotten. That was until 2010, when Rob Cooper relaunched Créme Yvette, a product formerly made by his father. In so doing he also revived interest in this cocktail. I worked with Rob on St-Germain at this time and I can attest to the efforts and expense he went to, in an effort to authentically replicate his family's liqueur.\r\rHowever, the Blue Moon is also made with crème de violette liqueur rather than Créme Yvette. Using Crème Yvette creates a pale pink drink (pictured) while crème de violette produces a blue-grey coloured drink that befits its name. The difference in colour leads me to conclude that the Blue Moon was originally made with crème de violette and then reimagined to market Crème Yvette.\r\rIncidentally, blue moon is an astronomical term for the second of two full moons to occur in the same calendar month.","glassWare":"Coupe glass","image":"https://cdn.diffords.com/contrib/stock-images/2018/05/5af2fdab72b3d.jpg","keywords":["Drink","Cocktail","Recipe"],"name":"Blue Moon Cocktail (1940's recipe)","nutrition":{"@type":"NutritionInformation","calories":"181 calories"},"prepTime":"PT04M0S","recipeCategory":"Drink","recipeCuisine":"Cocktail","recipeIngredient":["60 ml Gin","10 ml Crème de violette liqueur","10 ml Lemon juice (freshly squeezed)","5 ml Sugar syrup 'rich' (2 sugar to 1 water, 65.0°brix)","10 ml Pasteurised egg white (or aquafaba)"],"recipeInstructions":[{"@type":"HowToStep","text":"SHAKE all ingredients with ice and strain back into shaker"},{"@type":"HowToStep","text":"DRY SHAKE (without ice) and fine strain into chilled glass"}],"recipeYield":"1","slug":"blue-moon-cocktail-1940s-recipe","standardDrinks":"2.2","totalTime":"PT04M0S","url":"https://www.diffordsguide.com/en-au/cocktails/recipe/267/blue-moon-cocktail-1940s-recipe"}