{"@context":"https://schema.org","@type":"Recipe","aggregateRating":{"@type":"AggregateRating","bestRating":"5","ratingCount":2,"ratingValue":"4.5","worstRating":"0"},"author":"Anya Montague","datePublished":"2017-01-04 08:25:58","description":"\"In the last 3 years I have lived and tended bar in 8 different countries. My first port of call when the wheels touch the runway is to head straight to a bar - our place to meet old friends and make new ones - and even on the most distant islands you can always find a bottle of Bacardí on the back bar. My drink is an ode to all the extended family of bartenders and guests that have been my companions on this journey. Each ingredient in Companion is inspired by the story of fellow writer and traveler Ernest Hemmingway; his love for Bacardí rivaled his love for words and women. During his life he lived in France (pear and vermouth), Spain (lemon), Africa (black pepper and honey) and Cuba (Bacardí) with a different wife in each place. They were his travel companions, his drinking partners and his inspiration for writing. With a Companion, you'll never drink alone.\"\r\rWe say: Rum and pear with honey balancing lemon sourness. Vermouth (Anya's original recipe calls for Noilly Prat dry vermouth) adds complexity and plays an important role.","glassWare":"Nick \u0026 Nora glass","image":"https://cdn.diffords.com/contrib/stock-images/2018/05/5af300770b3ac.jpg","keywords":["Drink","Cocktail","Recipe"],"name":"Companion","nutrition":{"@type":"NutritionInformation","calories":"163 calories"},"prepTime":"PT02M0S","recipeCategory":"Drink","recipeCuisine":"Cocktail","recipeIngredient":["1 Black pepper","50 ml Bacardi Carta Blanca","10 ml Dry vermouth","2 Pear purée","15 ml Honey","20 ml Lemon juice (freshly squeezed)"],"recipeInstructions":[{"@type":"HowToStep","text":"MUDDLE peppercorns in base of shaker"},{"@type":"HowToStep","text":"Add other ingredients, SHAKE with ice and fine strain into chilled glass"}],"recipeYield":"1","slug":"companion","standardDrinks":"1.7","totalTime":"PT02M0S","url":"https://www.diffordsguide.com/en-au/cocktails/recipe/3905/companion"}