{"@context":"https://schema.org","@type":"Recipe","aggregateRating":{"@type":"AggregateRating","bestRating":"5","ratingCount":28,"ratingValue":"5.0","worstRating":"0"},"author":"Simon Difford","datePublished":"2017-06-09 07:38:22","description":"The Gimlet is classically equal parts gin and lime cordial stirred in the glass it is to be served in, with added ice being optional (but actually optimal). This is an old British Navy cocktail that predates mixology and refined London dry gins so, in pursuit of added depth of flavour, I like to add a touch of genever along with the gin.\r\rThe original lime cordial-heavy recipe is sickly sweet so the cordial needs cutting back (See Charles H. Bakers Jr.'s 1939 Gimlet recipe.) Inspired by Charles Schumann's 1995 Gimlet, I've cut the cordial with added fresh lime and lemon juices so boosting balancing citrus acidity while staying true to this cocktail's lime cordial DNA.\r\rSome misguided folk omit lime cordial altogether and call what is actually a lime Gin Sour a Gimlet. They should be punished with three days in the brig or at least be made to scrub the quarterdeck. A \"Gimlet\" without any lime cordial is simply not a gimlet!\r\rThe Gimlet is classically stirred but once you've added fresh citrus juice (unless you've clarified your juice) even if stirred this cocktail won't be perfectly clear. So do as Harry Craddock directs in his 1930 Savoy Cocktail Book and use some elbow grease to shake and invigorate this upper deck's cocktail.","glassWare":"Coupe glass","image":"https://cdn.diffords.com/contrib/stock-images/2018/05/5af304f30792b.jpg","keywords":["Drink","Cocktail","Recipe"],"name":"Gimlet Cocktail (Difford's recipe)","nutrition":{"@type":"NutritionInformation","calories":"154 calories"},"prepTime":"PT04M0S","recipeCategory":"Drink","recipeCuisine":"Cocktail","recipeIngredient":["50 ml Gin","20 ml Lime cordial (sweetened lime juice)","10 ml Oude genever","5 ml Lime juice (freshly squeezed)","5 ml Lemon juice (freshly squeezed)","5 ml Sugar syrup 'rich' (2 sugar to 1 water, 65.0°brix)"],"recipeInstructions":[{"@type":"HowToStep","text":"SHAKE all ingredients with ice and fine strain into chilled glass"}],"recipeYield":"1","slug":"gimlet-cocktail-diffords-recipe","standardDrinks":"2","totalTime":"PT04M0S","url":"https://www.diffordsguide.com/en-au/cocktails/recipe/831/gimlet-cocktail-diffords-recipe"}