{"@context":"https://schema.org","@type":"Recipe","aggregateRating":{"@type":"AggregateRating","bestRating":"5","ratingCount":51,"ratingValue":"4.5","worstRating":"0"},"author":"Simon Difford","datePublished":"2018-07-27 09:41:44","description":"All the Peruvian bartenders I've met prefer their Pisco Sours blended rather than shaken. Indeed, it is a brilliant cocktail when blended but I prefer my Pisco Sours shaken. (In Cuba Daiquiris also tend to be blended but I also prefer these shaken.)\r\rWhile some like to omit the egg white, like most sour-style cocktails, the Pisco Sour is better made with egg, although half the white of a small fresh egg white is plenty (around 15ml / ½oz). Some also advocate the use of powdered sugar in place of caster sugar syrup and indeed this can add to this sour (like the Daiquiri). In which case, you'll need 3 spoons (5ml sized measuring bowl) powdered sugar in place of the syrup.\r\rMore worthy of debate is the choice of pisco. My Peruvian friends favour pisco made from the Quebranta grape or even acholado (a blend of varieties). However, I prefer to use Peruvian pisco made from the more aromatic Italia grape, preferably mosto verde Italia pisco.\r\rConvention has it that the Pisco Sour is garnished with three drops of bitters dropped symmetrically onto its foaming head. This not only adds to the visual appearance, but the aroma of the bitters also helps mask the wet dog-like smell of egg white. Angostura or similar aromatic bitters are fine but for authenticity consider using Peruvian Amargo Chuncho bitters which are based on various Amazonian barks and herbs. Some also dust the surface of the drink, or the rim of the glass, with cinnamon.\r\rSomewhat controversially, if the use of Italia pisco were not enough, I also like to add a dash of orange flower water to my Pisco Sours. I also tend to serve them straight-up in a frozen heavy-bottomed old-fashioned glass to help retain the drink's cold temperature but a frozen coupe also works well.","glassWare":"Old-fashioned glass","image":"https://cdn.diffords.com/contrib/stock-images/2022/02/61fcf0839cb43.jpg","keywords":["Drink","Cocktail","Recipe"],"name":"Pisco Sour (Difford's recipe)","nutrition":{"@type":"NutritionInformation","calories":"152 calories"},"prepTime":"PT03M0S","recipeCategory":"Drink","recipeCuisine":"Cocktail","recipeIngredient":["60 ml Pisco","22.5 ml Lime juice (freshly squeezed)","15 ml Sugar syrup 'rich' (2 sugar to 1 water, 65.0°brix)","15 ml Pasteurised egg white (or aquafaba)","2.5 ml Orange flower/blossom water (optional)"],"recipeInstructions":[{"@type":"HowToStep","text":"SHAKE all ingredients with ice and strain back into shaker"},{"@type":"HowToStep","text":"DRY SHAKE (without ice) and fine strain into chilled glass"}],"recipeYield":"1","slug":"pisco-sour-diffords-recipe","standardDrinks":"1.9","totalTime":"PT03M0S","url":"https://www.diffordsguide.com/en-au/cocktails/recipe/1563/pisco-sour-diffords-recipe"}