{"@context":"https://schema.org","@type":"Recipe","aggregateRating":{"@type":"AggregateRating","bestRating":"5","ratingCount":1,"ratingValue":"4.5","worstRating":"0"},"author":"Andrew Bennett","datePublished":"2017-01-04 08:25:39","description":"\"Cuba has a golden history of cinema dating back to 1897, when silent movies were first shown on the island. Known as the 'seventh art,' cinema has been influential in defining the changing Cuban identity and how they view their place in the world. Celebrating this legacy, this cocktail is refreshing, modern and will remind you of your favourite movie experience with that quintessential popcorn flavour, while keeping the classic taste of Bacardí Carta Blanca front and centre.\"\r\rWe say: Confronted by a wide choice of popcorn at the supermarket we opted for Metcalfe's Honey Bee flavoured popcorn. The honey notes on the corn are very subdued and we wanted to avoid salted popcorn. As for the cocktail, tiny oily droplets from the sweetcorn form a layer on the surface of the drink and as you raise the glass to your lips the aroma of popcorn is surprisingly noticeable. Chartreuse slightly overwhelms the sweetcorn in what is a very enjoyable, boozy, Daiquiri-style cocktail.","glassWare":"Coupe glass","image":"https://cdn.diffords.com/contrib/stock-images/2018/05/5af3167de82af.jpg","keywords":["Drink","Cocktail","Recipe"],"name":"The Seventh Art","nutrition":{"@type":"NutritionInformation","calories":"165 calories"},"prepTime":"PT02M0S","recipeCategory":"Drink","recipeCuisine":"Cocktail","recipeIngredient":["1/2 Popcorn","50 ml Bacardi Carta Blanca","10 ml Chartreuse Yellow","20 ml Lemon juice (freshly squeezed)","7.5 ml Sugar syrup 'rich' (2 sugar to 1 water, 65.0°brix)"],"recipeInstructions":[{"@type":"HowToStep","text":"MUDDLE popcorn in base of shaker, add other ingredients, SHAKE with ice and fine strain into chilled glass"}],"recipeYield":"1","slug":"the-seventh-art","standardDrinks":"2","totalTime":"PT02M0S","url":"https://www.diffordsguide.com/en-au/cocktails/recipe/3926/the-seventh-art"}