{"@context":"https://schema.org","@type":"Recipe","author":"Rafal Nawrot","datePublished":"2017-01-03 16:23:50","description":"“Having at first seen bartending as just a job, it quickly became a passion and a way of life for me, always seeking perfection. I started to learn, practice, participate and compete. Finally, after 6 years of hard work, I managed to win the Bacardi Legacy Cocktail Competition in Poland in 2013. I flew to Puerto Rico expecting to win – but it was a tough lesson for me and I came away disappointed. However, having talked to David Cordoba, I at last understood that it isn’t always about winning – but about making history.\r \r“My inspiration for this cocktail is to create my own Legacy. I know now that you need to do something that will grow in people’s memory, just like Salvatore Calabrese with his Breakfast Martini. ‘Globetrotter’ features ingredients that are available all over the world. BACARDÍ Superior – the world’s favourite rum. Peach - probably the most acceptable taste in the world! Quince - one of the simplest fruit to grow. Earl Grey - the most appreciated tea! People will forget what you have told them, people will forget who you are, but people will never forget how you made them feel.”","glassWare":"Coupe glass","image":"https://cdn.diffords.com/contrib/stock-images/2018/05/5af315c50c49b.jpg","keywords":["Drink","Cocktail","Recipe"],"name":"The Globetrotter","nutrition":{"@type":"NutritionInformation","calories":"129 calories"},"prepTime":"PT02M0S","recipeCategory":"Drink","recipeCuisine":"Cocktail","recipeIngredient":["40 ml Bacardi Carta Blanca","10 ml Peach schnapps liqueur","20 ml *Special ingredient #1 (see above)","20 ml Earl Grey tea (cold)","10 ml Lemon juice (freshly squeezed)","5 ml Sugar syrup 'rich' (2 sugar to 1 water, 65.0°brix)"],"recipeInstructions":[{"@type":"HowToStep","text":"SHAKE all ingredients with ice and fine strain into chilled glass"},{"@type":"HowToStep","text":"\u003cstrong\u003eSpecial ingredient #1\u003c/strong\u003e: Quince juice"}],"recipeYield":"1","slug":"the-globetrotter","standardDrinks":"2","totalTime":"PT02M0S","url":"https://www.diffordsguide.com/en-au/cocktails/recipe/4019/the-globetrotter"}